mokeMX/dian_git/examples/follow_only1/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# A bit more headroom for the per-sensor tasks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Floating point is used heavily in the control loop; keep newlib nano off so
# printf("%f") works in logs.
CONFIG_NEWLIB_NANO_FORMAT=n

# Increase HTTP server header buffer limit (default 512 is too small for
# CSV download with Content-Disposition header).
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024

# Custom partition table with SPIFFS logs partition
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
